Revit 2024 API
BuiltInFailures.ElectricalFailures.MismatchVoltageToCircuit Property
 Cannot add [Element] to Circuit. The Voltage for [Element] is out of range for the Voltage ([Voltage Value]) for the Circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MismatchVoltageToCircuit { get; }
Visual Basic
Public Shared ReadOnly Property MismatchVoltageToCircuit As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MismatchVoltageToCircuit {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace